uhnp/src/Catalogs/СохраненныеНастройкиОтборов/СохраненныеНастройкиОтборов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>СохраненныеНастройкиОтборов</name>
  <hierarchical>true</hierarchical>
  <owners>Catalog.ТипыБазДанных</owners>
  <attributes>
    <name>ТекстЗапросаМодуля</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ТаблицаADO</name>
    <type>
      <types>CatalogRef.ТаблицыADO</types>
    </type>
  </attributes>
  <attributes>
    <name>ОбъектБД</name>
    <type>
      <types>CatalogRef.ДокументыБД</types>
      <types>CatalogRef.ПеречисленияБД</types>
      <types>CatalogRef.СправочникиБД</types>
      <types>CatalogRef.ПланыВидовХарактеристикБД</types>
    </type>
  </attributes>
  <attributes>
    <name>ТекстОтбора</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ДополнительноеПредставление</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ТипБДПриемник</name>
    <type>
      <types>CatalogRef.ТипыБазДанных</types>
    </type>
  </attributes>
  <attributes>
    <name>ТипОбъектаБД</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>30</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ИмяТаблицы</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>255</length>
      </stringQualifiers>
    </type>
  </attributes>
  <tabularSections>
    <name>ТаблицаПараметровОтбораБД</name>
    <attributes>
      <name>ПолеБД</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>255</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>НаименованиеБД</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>255</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>СпособВычисленияПараметра</name>
      <type>
        <types>EnumRef.СпособыВычисленияПараметровОперандов</types>
      </type>
    </attributes>
    <attributes>
      <name>ЗначениеДляПроверки</name>
      <type>
        <types>Boolean</types>
        <types>String</types>
        <types>Date</types>
        <types>Number</types>
        <types>AnyRef</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
        <stringQualifiers>
          <length>10</length>
        </stringQualifiers>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ТипРасчета</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>50</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Реквизит</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>255</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>СмещениеПериода</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>3</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>НастройкаСоответствия</name>
      <type>
        <types>CatalogRef.СоответствиеВнешнимИБ</types>
      </type>
    </attributes>
    <attributes>
      <name>ТаблицаАналитикиВИБ</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>500</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ТекстМодуля</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
    <attributes>
      <name>ИдентификаторСтроки</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ИдентификаторРодителя</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ИмяПараметра</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>255</length>
        </stringQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>УточненияСпособовОпределения</name>
    <attributes>
      <name>ИмяПараметра</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>255</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Значение</name>
      <type>
        <types>Boolean</types>
        <types>String</types>
        <types>Date</types>
        <types>Number</types>
        <types>AnyRef</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
        <stringQualifiers>
          <length>255</length>
        </stringQualifiers>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Представление</name>
      <type>
        <types>Boolean</types>
        <types>String</types>
        <types>Date</types>
        <types>Number</types>
        <types>AnyRef</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
        <stringQualifiers>
          <length>255</length>
        </stringQualifiers>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Пометка</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>Тип</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>100</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ПолеБД</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>255</length>
        </stringQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

uhnp/src/Enums/СпособыПолученияОперандов/СпособыПолученияОперандов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>СпособыПолученияОперандов</name>
  <enumValues>
    <name>ВнутренниеДанныеПоказательОтчета</name>
  </enumValues>
  <enumValues>
    <name>ВнутренниеДанныеПараметрическаяНастройка</name>
  </enumValues>
  <enumValues>
    <name>ВнутренниеДанныеПроизвольныйЗапрос</name>
  </enumValues>
  <enumValues>
    <name>ВнешниеДанныеРегистрБухгалтерии</name>
  </enumValues>
  <enumValues>
    <name>ВнешниеДанныеРегистрНакопления</name>
  </enumValues>
  <enumValues>
    <name>ВнешниеДанныеРегистрСведений</name>
  </enumValues>
  <enumValues>
    <name>ВнешниеДанныеПараметрическаяНастройка</name>
  </enumValues>
  <enumValues>
    <name>ВнешниеДанныеПроизвольныйЗапрос</name>
  </enumValues>
  <enumValues>
    <name>ФункцияНаВстроенномЯзыке</name>
  </enumValues>
  <enumValues>
    <name>ВнешниеДанныеОстаткиИОборотыИзПланаСчетов</name>
  </enumValues>
  <enumValues>
    <name>ВнешниеДанныеРегистр</name>
  </enumValues>
  <enumValues>
    <name>ВнутренниеДанныеРегистрНакопления</name>
  </enumValues>
  <enumValues>
    <name>ВнутренниеДанныеРегистрБухгалтерии</name>
  </enumValues>
  <enumValues>
    <name>ПроводкаТрансформационнойКорректировки</name>
  </enumValues>
  <enumValues>
    <name>ВнутренниеДанныеРегистрСведений</name>
  </enumValues>
  <enumValues>
    <name>ВнешниеДанныеADO</name>
  </enumValues>
  <enumValues>
    <name>ВнутренниеДанныеГруппаРаскрытия</name>
  </enumValues>
  <enumValues>
    <name>ВнутренниеДанныеСправочники</name>
  </enumValues>
  <enumValues>
    <name>ВнутренниеДанныеДокументы</name>
  </enumValues>
  <enumValues>
    <name>ВнешниеДанныеСправочники</name>
  </enumValues>
  <enumValues>
    <name>ВнешниеДанныеДокументы</name>
  </enumValues>
  <enumValues>
    <name>ВнутренниеДанныеРеквизитОбъектаБД</name>
  </enumValues>
</mdclass:Enum>

uhnp/src/Enums/СпособыЗаполненияПолейИсточника/СпособыЗаполненияПолейИсточника.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>СпособыЗаполненияПолейИсточника</name>
  <enumValues>
    <name>ПолеИсходнойТаблицы</name>
  </enumValues>
  <enumValues>
    <name>КонтекстОбъектаЗагрузки</name>
  </enumValues>
  <enumValues>
    <name>ФиксированноеЗначение</name>
  </enumValues>
  <enumValues>
    <name>РучнойВвод</name>
  </enumValues>
  <enumValues>
    <name>ПолеДругогоИсточникаДанных</name>
  </enumValues>
</mdclass:Enum>

uhnp/src/Catalogs/СохраненныеНастройкиОтборов/ManagerModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

Функция ПолучитьТаблицуЭлементовПоОтбору(СправочникОтбор,ТолькоПроверка=Истина,НастройкаСоответствия=Неопределено) Экспорт
	
	ИсточникОбъект=ПолучитьИсточникПоНастройке(СправочникОтбор,НастройкаСоответствия,ТолькоПроверка); 
	
	Возврат  УправлениеОтчетамиУХ.ПолучитьТаблицуДанныхПоИсточнику(Неопределено,ИсточникОбъект,ТолькоПроверка); 
		
КонецФункции // ПолучитьТаблицуЭлементовПоОтбору() 

Функция ПолучитьИсточникПоНастройке(СправочникОтбор,НастройкаСоответствия=Неопределено,ТолькоПроверка=Ложь) Экспорт 
	
	ОтборОбъект=СправочникОтбор.ПолучитьОбъект();
	ИсточникОбъект=Справочники.ИсточникиДанныхДляРасчетов.СоздатьЭлемент();
	
	ЗаполнитьЗначенияСвойств(ИсточникОбъект,ОтборОбъект,,"Ссылка,Родитель,Владелец");
	ИсточникОбъект.Код="Технический";
	ИсточникОбъект.ТипБД=ОтборОбъект.Владелец; 
	ИсточникОбъект.ПотребительРасчета=Справочники.ПоказателиОтчетов.ПустаяСсылка();
	
	ИсточникОбъект.ТаблицаПараметровОтбораБД.Загрузить(ОтборОбъект.ТаблицаПараметровОтбораБД.Выгрузить());
	ИсточникОбъект.УточненияСпособовОпределения.Загрузить(ОтборОбъект.УточненияСпособовОпределения.Выгрузить()); 
	ИсточникОбъект.ОбъектБД=ОтборОбъект.ОбъектБД; 
		
	НоваяСтрока=ИсточникОбъект.ПравилаИспользованияПолейЗапроса.Добавить(); 
	НоваяСтрока.Поле="Ссылка";
	НоваяСтрока.Синоним="Ссылка";
	НоваяСтрока.КодАналитики="Ссылка";
	
	Если НЕ ОтборОбъект.Владелец=Справочники.ТипыБазДанных.ТекущаяИБ Тогда 
		
		Если НастройкаСоответствия=Неопределено Тогда
			
			Запрос=Новый Запрос;
			Запрос.Текст="ВЫБРАТЬ ПЕРВЫЕ 1
			|	СоответствиеВнешнимИБ.Ссылка КАК Ссылка
			|ИЗ
			|	Справочник.СоответствиеВнешнимИБ КАК СоответствиеВнешнимИБ
			|ГДЕ
			|	СоответствиеВнешнимИБ.Владелец = &Владелец
			|	И СоответствиеВнешнимИБ.ОписаниеОбъектаВИБ = &ОписаниеОбъектаВИБ";
			
			Запрос.УстановитьПараметр("Владелец",ОтборОбъект.Владелец);
			Запрос.УстановитьПараметр("ОписаниеОбъектаВИБ",ОтборОбъект.ОбъектБД);
			
			Результат=Запрос.Выполнить().Выбрать();
			
			Если Результат.Следующий() Тогда
				
				НастройкаСоответствия=Результат.Ссылка;
				
			КонецЕсли;
			
			Если НастройкаСоответствия=Неопределено Тогда
				
				Возврат Новый ТаблицаЗначений;
				
			КонецЕсли;
			
		КонецЕсли;
		
		НоваяСтрока.НастройкаСоответствия=НастройкаСоответствия;		
		ИсточникОбъект.СпособПолучения=Перечисления.СпособыПолученияОперандов.ВнешниеДанныеСправочники;
		
	Иначе
		
		ИсточникОбъект.СпособПолучения=Перечисления.СпособыПолученияОперандов.ВнутренниеДанныеСправочники;	
		
	КонецЕсли;
	
	НоваяСтрока.СпособЗаполнения=Перечисления.СпособыЗаполненияПолейИсточника.ПолеИсходнойТаблицы;
	НоваяСтрока.ФиксированноеЗначение = Неопределено;
	
	Возврат ИсточникОбъект;
		
КонецФункции // ПолучитьИсточникПоНастройке() 
	
#КонецЕсли
